
# languages
# brew 'go'
# brew 'pyenv'
brew 'telnet'
brew 'shellcheck'
brew 'asdf'
brew 'rg'
brew 'poetry'
brew 'kubectl'
brew 'kubectx' #'kubens' is included
brew 'ffmpeg'
brew 'gifski'

# Applications
# cask 'atom'
cask 'iterm2'
cask 'ghostty'
#cask 'logitech-myharmony'
cask 'mailplane'
# cask 'mysqlworkbench'
cask 'postman'
# cask 'royal-tsx'
# cask 'slack'
cask 'spotify'
cask 'suspicious-package'
# cask 'vagrant'
# cask 'virtualbox'
cask 'vlc'
cask 'whatsapp'
cask 'visual-studio-code'
cask 'docker'
cask 'signal'
cask 'discord'
# Apple stuff
# mas 'Xcode', id: 497799835
# cask 'kubectl'
# cask 'awscli'
cask 'sublime-text'

# App Store
mas 'Apple Remote Desktop', id: 409907375
mas 'Microsoft Remote Desktop 10', id: 129520346
# mas 'Slack', id: 803453959
# mas 'LastPass', id: 926036361
# mas 'Simplenote', id: 289429962
# mas 'Reeder 3', id: 880001334
